working-title/app/controllers/projects_controller.rb

SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT 1
---
  def create
    @user = User.first