working-title/app/controllers/projects_controller.rb

  def new
    @project = Project.new
    @categories = Category.all.map { |c| [c.name, c.id]}
---
SELECT "categories".* FROM "categories" ORDER BY "categories"."id" ASC LIMIT 1

  def create
    @project = current_user.projects.create(project_params)
    @project.versions.create!(contributor: @project.initiator, contribution: params[:initial_text], insertion_index: -1)
    redirect_to project_version_path(@project, @project.versions.first)
---
INSERT INTO "projects" ("category_id", "created_at", "initiator_id", "name", "updated_at") VALUES (?, ?, ?, ?, ?)  [["category_id", 2], ["created_at", Wed, 17 Sep 2014 18:37:52 UTC +00:00], ["initiator_id", 1], ["name", "Ricky"], ["updated_at", Wed, 17 Sep 2014 18:37:52 UTC +00:00]]
INSERT INTO "versions" ("contributor_id", "created_at", "insertion_index", "project_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["contributor_id", 6], ["created_at", Thu, 18 Sep 2014 22:56:05 UTC +00:00], ["insertion_index", 0], ["project_id", 18], ["updated_at", Thu, 18 Sep 2014 22:56:05 UTC +00:00]]
SELECT "versions".* FROM "versions" WHERE "versions"."project_id" = ? ORDER BY "versions"."id" ASC LIMIT 1  [["project_id", 7]]