working-title/app/controllers/versions_controller.rb

  def index
    @project = Project.find(params[:project_id])
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? ORDER BY "projects"."id" ASC LIMIT 1  [["id", 5]]

  def show
    @version = Version.find(params[:id])
---
SELECT "versions".* FROM "versions" WHERE "versions"."id" = ? ORDER BY "versions"."id" ASC LIMIT 1  [["id", 52]]

  def create
    @version = Version.create(version_params)
---
INSERT INTO "versions" ("created_at", "insertion_index", "previous_version_id", "project_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Thu, 18 Sep 2014 20:20:12 UTC +00:00], ["insertion_index", -1], ["previous_version_id", 3], ["project_id", 1], ["updated_at", Thu, 18 Sep 2014 20:20:12 UTC +00:00]]