working-title/app/controllers/votes_controller.rb

  def create
    voteable_type = votes_params[:voteable_type]
    voteable_id = votes_params[:voteable_id]
    if Vote.where(user_id: current_user.id, voteable_id: voteable_id, voteable_type: voteable_type).length == 0
      @vote = current_user.votes.create(votes_params)
    end

    if voteable_type == "Project"
      passback = Project.find(voteable_id).calculate_vote_score
    elsif voteable_type == "Version"
      passback = Version.find(voteable_id).calculate_branch_vote_score
---
SELECT "votes".* FROM "votes" WHERE "votes"."user_id" = 10 AND "votes"."voteable_id" = 5 AND "votes"."voteable_type" = 'Project'
INSERT INTO "votes" ("created_at", "positive", "updated_at", "user_id", "voteable_id", "voteable_type") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Thu, 18 Sep 2014 20:26:07 UTC +00:00], ["positive", true], ["updated_at", Thu, 18 Sep 2014 20:26:07 UTC +00:00], ["user_id", 10], ["voteable_id", 3], ["voteable_type", "Project"]]
SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", "3"]]
SELECT "versions".* FROM "versions" WHERE "versions"."id" = ? ORDER BY "versions"."id" ASC LIMIT 1  [["id", 79]]