app/controllers/projects_controller.rb

  def new
    @project = Project.new
    @categories = Category.all.map { |c| [c.name, c.id]}
---
SELECT "categories".* FROM "categories"

  def create
    @project = current_user.projects.create(project_params)
    # Replaced with database callback and validations:
    # @project.versions.create!(contributor: @project.initiator, contribution: params[:initial_text], insertion_index: -1)
    redirect_to project_version_path(@project, @project.versions.first)
---
INSERT INTO "projects" ("category_id", "created_at", "initiator_id", "name", "updated_at") VALUES (?, ?, ?, ?, ?)  [["category_id", 1], ["created_at", Fri, 19 Sep 2014 21:12:01 UTC +00:00], ["initiator_id", 1], ["name", "besssst"], ["updated_at", Fri, 19 Sep 2014 21:12:01 UTC +00:00]]
SELECT "versions".* FROM "versions" WHERE "versions"."project_id" = ? ORDER BY "versions"."id" ASC LIMIT 1  [["project_id", 12]]