app/controllers/users_controller.rb

  def create
    @user = User.new(new_user_params)

    if @user.save
---
INSERT INTO "users" ("created_at", "email", "name", "password_digest", "updated_at") VALUES (?, ?, ?, ?, ?)

  def destroy
    @user = User.find(params[:id])
    sign_out
    @user.destroy
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "8"]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 8]]