app/controllers/versions_controller.rb

SELECT "versions".* FROM "versions" WHERE "versions"."id" = ? ORDER BY "versions"."id" ASC LIMIT 1  [["id", 133]]
---
  def show
    @version = Version.find(params[:id])

INSERT INTO "versions" ("contribution", "contributor_id", "created_at", "insertion_index", "previous_version_id", "project_id", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @version = current_user.versions.create(version_params)