app/views/categories/show.html.erb

  <div class="all_category_projects">
    <% @category.projects.each do |project| %>
---
SELECT "projects".* FROM "projects" WHERE "projects"."category_id" = ?  [["category_id", 2]]